vmv62/stm32modbus_cntl/main.c
#include "stm32f0xx.h"
#include "modbus.h"
#include "hw_init.h"

void hdw_init();
int get_adc();
void dma_start_transsmit(uint8_t *buffer, uint16_t buffer_len);
void dma_usart_config(uint8_t *buffer, uint16_t buffer_len);


//Структура для хранения сервиных регистров.
static struct {
	uint8_t end_transmission;
	uint32_t byte_count;
}Serv;

//Объявляем структуры таблицы регистров и структуры ПДУ.
PDU_TypeDef PDU;
RegsTable_TypeDef REGS;



int main(void)
{
	//Инициализируем члены сервисной структуры.
	Serv.byte_count = 0;	//Считаем принятые байты
	Serv.end_transmission = 0; //Флаг конца приема ПДУ.
	hdw_init();			//Инициализация переферии.
	dma_usart_config(&PDU, sizeof(PDU));
    while(1)
    {
    	//Обработчик состояния выставленного флага конца передачи.
    	if(Serv.end_transmission){
    		Serv.end_transmission = 0;
    		pase_pdu(&PDU, &REGS);
    		dma_start_transsmit(&PDU, sizeof(PDU));
    	}
    	regs_filling(&REGS);
    }
}



void USART1_IRQHandler(void){
	if(USART1->ISR & USART_ISR_RXNE){	//Прерывание "регистр приема не пуст"
		BUFFER[Serv.byte_count] = (uint8_t)(USART1->RDR);
		USART1->CR1 |= USART_CR2_RTOEN;
		USART1->CR1 |= USART_CR1_RTOIE;	//Включение прерывания по простою линии приема.
		Serv.byte_count++;			//Почему то не инкрементируется? Видимо переменная не видна.
	}
	if(USART1->ISR & USART_ISR_RTOF){	//Прерывание по простою линии приема
		USART1->CR1 &= ~USART_CR1_RTOIE;
		USART1->ICR |= USART_ICR_RTOCF; //Сброс флага прерывания по простою линии приема.
//		USART1->CR1 &= ~USART_CR1_RTOIE; //Отключаем прерывание по простою, чтобы оно не мешало.
//		USART1->RQR &= ~USART_RQR_RXFRQ;
		Serv.end_transmission = 1;		//Переменная инициализируется это работает.
	}
}
